In [1]:
#Import dependencies
import pandas as pd
import matplotlib.pyplot as plt
from config import key
from sqlalchemy import create_engine

In [5]:
# Create Engine for SQLChallenge DB
engine = create_engine(f'postgresql://postgres:{key}@localhost:5432/SQLChallenge')
conn = engine.connect()

# Create Salaries Dataframe with SQL Query
salaries = pd.read_sql("SELECT * FROM salaries", conn)
salaries.head()

  emp_no  salary
0  10001   60117
1  10002   65828
2  10003   40006
3  10004   40054
4  10005   78228